require "gyou/version"

module Gyou

  DICTIONARY = {
    'あ' => 'あ', 'い' => 'あ', 'う' => 'あ', 'え' => 'あ', 'お' => 'あ', 'ぁ' => 'あ', 'ぃ' => 'あ', 'ぅ' => 'あ', 'ぇ' => 'あ', 'ぉ' => 'あ', 'か' => 'か', 'き' => 'か', 'く' => 'か', 'け' => 'か', 'こ' => 'か', 'さ' => 'さ', 'し' => 'さ', 'す' => 'さ', 'せ' => 'さ', 'そ' => 'さ', 'た' => 'た', 'ち' => 'た', 'つ' => 'た', 'て' => 'た', 'と' => 'た', 'な' => 'な', 'に' => 'な', 'ぬ' => 'な', 'ね' => 'な', 'の' => 'な', 'は' => 'は', 'ひ' => 'は', 'ふ' => 'は', 'へ' => 'は', 'ほ' => 'は', 'ま' => 'ま', 'み' => 'ま', 'む' => 'ま', 'め' => 'ま', 'も' => 'ま', 'や' => 'や', 'ゃ' => 'や', 'ゆ' => 'や', 'ゅ' => 'や', 'よ' => 'や', 'ょ' => 'や', 'わ' => 'わ', 'を' => 'わ', 'ん' => 'わ'
  }

  def self.get text
    raise "not string" unless text.instance_of? String
    raise "empty" if text.empty?

    first_character = text[0..0]

    raise "not hiragana" unless first_character.match(/^[ぁ-ん]/)

    DICTIONARY[first_character]
  end
end
